package javaHomeWork;
//조건문과 반복문 문제
//1. 1부터 20까지의 정수 중 2 또는 3의 배수가 아닌 수의 총합을 구하시오.
//2. 1 + (1 + 2) + (1 + 2 + 3 ) .... + (1 + 2 + .... + 10) 의 결과를 구하시오.
//3. 1 + (-2) + 3 + (-4) ..... 이렇게 계속 더하였을 때 몇까지 더해야 총합이 100 이상이 나오는지 구하시오.
//4. 두 개의 주사위를 던졌을 때 눈의 합이 6이 되는 모든 경우의 수를 출력하시오.
//5. 방정식 2x + 4y = 10 의 모든 해를 구하시오.
//6. 숫자를 입력받아 각 자리의 합을 더한 결과를 출력하는 코드를 작성하시오. (ex> 12345 입력시 1 + 2 + 3 + 4 + 5 의 결과 출력)
//7. 피보나치 수열의 10번째 수는 무엇인지 계산하는 프로그램을 작성하시오.
//   (피보나치 수열이란 바로 전의 두 수를 더한 수가 다음 수가 되는 수열이다. 0, 1, 1, 2, 3, 5, 8, 13 .... )
//8. 주어진 문자열이 숫자인지 판별하는 프로그램을 작성하시오.
//9. 숫자맞추기 게임
//   1) 컴퓨터는 1부터 100까지의 수 중 임의의 수를 지정합니다.
//   2) 사용자가 숫자를 입력 시 up, down 으로 지정된 수보다 큰지 작은지를 알려줍니다.
//   3) 사용자가 숫자를 맞추면 컴퓨터는 몇 번 만에 숫자를 맞추었는지 출력합니다.
//
//10. 입력받은 수가 회문수가 맞는지를 검사하는 프로그램을 작성하시오.
//   (회문수(palindrome)란 ? 앞으로 읽어도 뒤로 읽어도 같은 수. ex> 12321)
public class Variable {
	//변수 문제
	//1. 주민등록번호를 숫자로 저장하려 한다. 변수를 선언하고 자신의 주민등록번호를 초기화 하는 코드를 작성하시오.
	//2. 메인 메소드를 작성하시오.
	public static void main(String[] args) {
		long num = 8907262000000l;
	}
}
